%% 设置仿真参数
function sim_param = sim_params()
%% 参数设置 - 设置基本参数
chanBW = 2;             %信道带宽[1, 2, 3, 4] for 1.4MHz, 3MHz, 5MHz, 10MHz
sim_param.N_pilot = 4;             %导频数量 2导频 or 4导频
sim_param.modType  = 1;        %调制方式[1, 2] for ['QPSK,'16QAM']
sim_param.Rx = 2;                 %接收天线数
sim_param.corrLevel = 'Low';
sim_param.chanEstOn = 1;                 %真实信道估计:1   /    理想信道估计:0
sim_param.chanMode = 'MIMO';             %信道模型 rayleigh, MIMO, LTEMIMO
sim_param.interMode = 'spline';             %信道估计-内插方式 average,lagrange,spline
sim_param.Eqmode   = 2;      %均衡方式[1,2] for ['ZF', 'MMSE']
sim_param.snrdB       = 1;      %高斯白噪声
sim_param.mapper_type=1;  % 导频插入位置 1[3 6 9 12]  2[2 6 9 13]   3[1 5 9 13]  4[2 6 10 13].

sim_param.user_speed = 280/3.6;   %用户移动速度
%% 参数生成 - 由基本参数，或本项目议定参数，生成对应的仿真参数
sim_param.turboRate            = 1/3; % Turbo码率
sim_param.deltaF = 15e3;    %子载波间隔
sim_param.Nrb_sc = 12;      %每RB子载波数量
sim_param.N_symb = 7;     %每时隙符号数
sim_param.N_slot = 2;     %每时隙符号数
switch chanBW
    case 1      % 1.4 MHz
        BW = 1.4e6; N = 128; cpLen0 = 10; cpLenR = 9;
        Nrb = 6; chanSRate = 1.92e6;
    case 2      % 3 MHz
        BW = 3e6; N = 256; cpLen0 = 20; cpLenR = 18;
        Nrb = 15; chanSRate = 3.84e6;
    case 3      % 5 MHz
        BW = 5e6; N = 512; cpLen0 = 40; cpLenR = 36;
        Nrb = 25; chanSRate = 7.68e6;
    case 4      % 10 MHz
        BW = 10e6; N = 1024; cpLen0 = 80; cpLenR = 72;
        Nrb = 50; chanSRate = 15.36e6;
    case 5      % 15 MHz
        BW = 15e6; N = 1536; cpLen0 = 120; cpLenR = 108;
        Nrb = 75; chanSRate = 23.04e6;
    case 6      % 20 MHz
        BW = 20e6; N = 2048; cpLen0 = 160; cpLenR = 144;
        Nrb = 100; chanSRate = 30.72e6;
end
sim_param.chanBW = chanBW;          %信道带宽参数
sim_param.BW = BW;          %信道带宽
sim_param.Nrb = Nrb;        %RB数量
sim_param.N = N;            %IFFT点数
sim_param.M = Nrb*sim_param.Nrb_sc;   %DFT点数=子载波数
sim_param.cpLen0 = cpLen0;  %cp0长度
sim_param.cpLenR = cpLenR;  %其他CP长度
sim_param.chanSRate = chanSRate;    %信道数据速率
sim_param.Qm = 2 * sim_param.modType; %每符号bit数

sim_param.N_soft=8000000;
sim_param.HARQ_processes=8;
sim_param.sub_block_interleaver_permutation_pattern = [0,16,8,24,4,20,12,28,2,18,10,26,6,22,14,30,1,17,9,25,5,21,13,29,3,19,11,27,7,23,15,31];
sim_param.sub_block_interleaver_permutation_pattern_plus_one = sim_param.sub_block_interleaver_permutation_pattern+1;
sim_param.null_bit = 3;
sim_param.turbo_interleaver_table = [40,3,10;48,7,12;56,19,42;64,7,16;72,7,18;80,11,20;88,5,22;96,11,24;104,7,26;112,41,84;120,103,90;128,15,32;136,9,34;144,17,108;152,9,38;160,21,120;168,101,84;176,21,44;184,57,46;192,23,48;200,13,50;208,27,52;216,11,36;224,27,56;232,85,58;240,29,60;248,33,62;256,15,32;264,17,198;272,33,68;280,103,210;288,19,36;296,19,74;304,37,76;312,19,78;320,21,120;328,21,82;336,115,84;344,193,86;352,21,44;360,133,90;368,81,46;376,45,94;384,23,48;392,243,98;400,151,40;408,155,102;416,25,52;424,51,106;432,47,72;440,91,110;448,29,168;456,29,114;464,247,58;472,29,118;480,89,180;488,91,122;496,157,62;504,55,84;512,31,64;528,17,66;544,35,68;560,227,420;576,65,96;592,19,74;608,37,76;624,41,234;640,39,80;656,185,82;672,43,252;688,21,86;704,155,44;720,79,120;736,139,92;752,23,94;768,217,48;784,25,98;800,17,80;816,127,102;832,25,52;848,239,106;864,17,48;880,137,110;896,215,112;912,29,114;928,15,58;944,147,118;960,29,60;976,59,122;992,65,124;1008,55,84;1024,31,64;1056,17,66;1088,171,204;1120,67,140;1152,35,72;1184,19,74;1216,39,76;1248,19,78;1280,199,240;1312,21,82;1344,211,252;1376,21,86;1408,43,88;1440,149,60;1472,45,92;1504,49,846;1536,71,48;1568,13,28;1600,17,80;1632,25,102;1664,183,104;1696,55,954;1728,127,96;1760,27,110;1792,29,112;1824,29,114;1856,57,116;1888,45,354;1920,31,120;1952,59,610;1984,185,124;2016,113,420;2048,31,64;2112,17,66;2176,171,136;2240,209,420;2304,253,216;2368,367,444;2432,265,456;2496,181,468;2560,39,80;2624,27,164;2688,127,504;2752,143,172;2816,43,88;2880,29,300;2944,45,92;3008,157,188;3072,47,96;3136,13,28;3200,111,240;3264,443,204;3328,51,104;3392,51,212;3456,451,192;3520,257,220;3584,57,336;3648,313,228;3712,271,232;3776,179,236;3840,331,120;3904,363,244;3968,375,248;4032,127,168;4096,31,64;4160,33,130;4224,43,264;4288,33,134;4352,477,408;4416,35,138;4480,233,280;4544,357,142;4608,337,480;4672,37,146;4736,71,444;4800,71,120;4864,37,152;4928,39,462;4992,127,234;5056,39,158;5120,39,80;5184,31,96;5248,113,902;5312,41,166;5376,251,336;5440,43,170;5504,21,86;5568,43,174;5632,45,176;5696,45,178;5760,161,120;5824,89,182;5888,323,184;5952,47,186;6016,23,94;6080,47,190;6144,263,480];
sim_param.maxIter = 6; %turbo编码迭代次数
sim_param.trellis = poly2trellis(4, [13 15], 13); %来自DLSCH
sim_param.userBits = sim_param.M*(sim_param.N_symb*sim_param.N_slot-sim_param.N_pilot)*sim_param.Qm; %用户比特数
sim_param.numResources = sim_param.M*14;
end